clc;
clear;
%=================================
%系统参数
%=================================
A=[0,1,0,0;
   0,0,-1.176,0;
   0,0,0,1;
   0,0,18.293,0];
B=[0;1;0;-1.667];
C=[1,0,0,0; 0,0,1,0];
%=================================
%判断能控性、能观性
%=================================
rQc=rank(ctrb(A,B));
rQo=rank(obsv(A,C));
%=================================
%计算系统的特征根并配置特征根
%=================================
polyA=poly(A);
rootA=roots(polyA);
P=[-2,-3,-4,-5];
K=place(A,B,P);
PG=4.*P;
G=place(A',C',PG)';
%=================================
%仿真
%=================================
out=sim('s6');  %运行模型
t=out.tout;     %仿真时间
%画图
hf=figure(1);
plot(t,out.y);  %系统的输出
[ym,n]=min(out.y,[],1);
hte=text(t(n),ym,['位移','角度']);
myPlotFormat(hte,20,hf,'系统输出');

hf=figure(2);
plot(t,out.y1)
[ym,n]=min(out.y,[],1);
hte=text(t(n),ym,['位移','角度']);
myPlotFormat(hte,20,hf,'状态观测器输出');